In [1]:
import pandas as pd

In [2]:
data = pd.Series([12,4,4,6,3,2,5,666,222,44])
data

0     12
1      4
2      4
3      6
4      3
5      2
6      5
7    666
8    222
9     44
dtype: int64

In [3]:
print('最大值：',data.max())
print('最小值：',data.min())
print('平均值：',data.mean())
print('标准差：',data.std())

最大值： 666
最小值： 2
平均值： 96.8
标准差： 211.16702183606017

In [4]:
import pandas as pd
data = pd.DataFrame({
    'Name':['zs','lisi','ww'],
    'Sno':['1001','1002','1003'],
    'Sex':['man','woman','man'],
    'Age':[17,18,19],
    'Score':[80,97,95]
},columns=['Sno','Sex','Age','Score'],index=['zs','lisi','ww'])
data

       Sno    Sex  Age  Score
zs    1001    man   17     80
lisi  1002  woman   18     97
ww    1003    man   19     95

In [6]:
#获取age的最大   最小   平均值   标准差
ages = data['Age']
ages

zs      17
lisi    18
ww      19
Name: Age, dtype: int64

In [7]:
type(ages)

pandas.core.series.Series

In [8]:
print('最大年龄：',ages.max())
print('最小年龄：',ages.min())
print('平均年龄：',ages.mean())
print('标准差：',ages.std())

最大年龄： 19
最小年龄： 17
平均年龄： 18.0
标准差： 1.0

### 筛选出成绩大于平均值的数据

In [9]:
data

       Sno    Sex  Age  Score
zs    1001    man   17     80
lisi  1002  woman   18     97
ww    1003    man   19     95

In [10]:
#1.获取成绩所有数据
scores = data.loc[:,'Score']
scores

zs      80
lisi    97
ww      95
Name: Score, dtype: int64

In [11]:
scores.mean()

90.66666666666667

In [13]:
scores>scores.mean()

zs      False
lisi     True
ww       True
Name: Score, dtype: bool

In [14]:
#过滤
scores[scores>scores.mean()]

lisi    97
ww      95
Name: Score, dtype: int64

### 获取成绩大于平均值得所有记录，只显示Sno Age Score三列

In [15]:
data

       Sno    Sex  Age  Score
zs    1001    man   17     80
lisi  1002  woman   18     97
ww    1003    man   19     95

In [16]:
#获取成绩大于平均值得所有记录
data[scores>scores.mean()]

       Sno    Sex  Age  Score
lisi  1002  woman   18     97
ww    1003    man   19     95

### 只显示Sno Age Score三列

In [17]:
data[scores>scores.mean()].loc[:,['Sno','Age','Score']]

       Sno  Age  Score
lisi  1002   18     97
ww    1003   19     95